docs/blog/posts/orders-of-existence.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-07-20 Mon 23:26 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Orders of existence</title>
<meta name="author" content="Paul T" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/tufte.css" type="text/css" />
<link rel="stylesheet" href="/ox-tufte.css" type="text/css" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<meta name="description" content="Paul S. Tang">
<meta name="twitter:creator" content="@_ptsw">
<meta name="twitter:card" content="summary">
<link rel="canonical" href="https://ptsw.ca">
<link href="/feed.xml" type="application/atom+xml" rel="alternate" title="plateaux Feed">

</head>
<body>
<header id="preamble" class="status">
<nav>
  <div class="site-title"><a href="/">plateaux</a></div>
  <div class="site-nav">
    <a href="/about/">About</a>
    <a href="/stuff/">Stuff</a>
    <a href="/blog/">Posts</a>
    <a href="/books/">Reading</a>
  </div>
</nav>
<br/>
</header>
<article id="content" class="content">
<header>
<h1 class="title">Orders of existence</h1>
</header><p>
What does naming big numbers have to do with the technological sophistication of a society?
</p>

<p>
There is a famous <a href="https://www.scottaaronson.com/writings/bignumbers.html">blog post</a> by Scott Aaronson in which he posits that we can use our ability to describe bigger and bigger finite numbers<label id='fnr.1' for='fnr-in.1.9790334' class='margin-toggle sidenote-number'><sup class='numeral'>1</sup></label><input type='checkbox' id='fnr-in.1.9790334' class='margin-toggle'><span class='sidenote'><sup class='numeral'>1</sup>
Arguably, we can extend the game to bigger and bigger <i>infinite</i> numbers as well; mathematical set theory is full of differently-sized infinities, such as the cardinality of the natural numbers (\(\aleph_0\)), the cardinality of the real numbers (\[\aleph_1 > aleph_0\]), and so on.
</span> as a marker of our society's advancement in the theoretico-quantitative pursuits, and in the empirical and deductive fields more generally. It goes like this: ask a room of children<label id='fnr.2' for='fnr-in.2.2856921' class='margin-toggle sidenote-number'><sup class='numeral'>2</sup></label><input type='checkbox' id='fnr-in.2.2856921' class='margin-toggle'><span class='sidenote'><sup class='numeral'>2</sup>
&#x2026;Or adults! Or better yet, a room of combinatorialists!
</span> to write down the biggest number they can on an index card; the winner is the one who can name the biggest number. One child might write "1" followed by as many zeros as they can fit within the index card; another child might be a tad more clever and fill it with nines. Asking older and wiser students to play the game now, a clever secondary student might use \[\exp(999\ldots 9)\], while a smarter classmate might know that `^` is notation for exponentiation, and fill the card with `9<sup>9</sup>^&#x2026;<sup>9</sup>`. A university student concentrating in mathematics might be familiar with <a href="https://en.wikipedia.org/wiki/Tetration">tetration</a>, <a href="https://en.wikipedia.org/wiki/Pentation">pentation</a>, and the other hyperexponentiation functions, while a computer science concentrator might invoke the <a href="https://en.wikipedia.org/wiki/Ackermann_function">Ackermann function</a>. And so on. Note how each guess gets progressively more advanced, and the intellectual building blocks needed to generate and understand each proposal require progressively more mathematical and logical theory.
</p>

<p>
If Aaronson's numbers game is one metric for viewing the progress of broader society's cognitive frontier, I would like to propose another gamified metric, this time straddling the edge between the natural, the social, and the metaphysical. The game is this: the first player, the <i>proposer</i>, must provide the most general criterion for existence; the second player, an <i>adversary</i>, must name a specific concept that does not meet that criterion. All of the tools of science, logic, mathematics, and the social sciences, and any field more broadly are available to either player. The rules are kept intentionally vague to stir debate.
</p>

<p>
One might imagine, for instance, that it suffices for the proposer to claim that something exists if it is composed of atoms. <i>But what about neutrinos and quarks?</i>, the adversary replies.
</p>

<p>
<i>Very well</i>, the proposer reacts; <i>how about anything composed of subatomic particles</i><label id='fnr.3' for='fnr-in.3.572549' class='margin-toggle sidenote-number'><sup class='numeral'>3</sup></label><input type='checkbox' id='fnr-in.3.572549' class='margin-toggle'><span class='sidenote'><sup class='numeral'>3</sup>
&#x2026;Or strings, presuming some variant of string theory is valid.
</span>? Adversary: <i>Your approach fails to account for the Ship of Theseus<label id='fnr.4' for='fnr-in.4.4993595' class='margin-toggle sidenote-number'><sup class='numeral'>4</sup></label><input type='checkbox' id='fnr-in.4.4993595' class='margin-toggle'><span class='sidenote'><sup class='numeral'>4</sup>
The <a href="https://en.wikipedia.org/wiki/Ship_of_Theseus">Ship of Theseus</a> paradox asks: if a given ship has its components replaced gradually over time, component-by-component, is it still the same ship?
</span> problem. By your account, since humans may replace all of their cells within a lifetime, a single human would not even exist!</i>
</p>

<p>
You might be able to imagine how it proceeds from here: the first player constructs a criterion that allows for locality of space and time as a criterion. Eventually, the second player will think of things ephemeral: the economy; the internet; aesthetics; mathematics itself. As retorts, the proposer includes the class of all concepts possessing an attached field of human academic study or a related profession; all concepts that are quantitatively measured in some aspect; all concepts ever dreamt of by at least one human being; and so on.
</p>

<p>
Finally, after several rounds, the first player might take the bold step of defining a criterion thusly: enumerate all possible formal languages &#x2014; countable as they are &#x2014; and say that a concept <i>exists</i> if there exists at least one well-formed formula that describes it within at least one language, adjoining the class of all natural language nouns as primitives in some suitable (model-based) sense. This criterion would include everything governed by the <a href="https://en.wikipedia.org/wiki/Wightman_axioms">Wightman axioms</a> (and any correct or incorrect physical theory, at that), all potential correct and incorrect formal models of the economy, all precise descriptions of aesthetics, and so on. But does this "enumeration over languages" approach open up the possibility of a <a href="https://en.wikipedia.org/wiki/Halting_problem">diagonalization-style argument</a> that the adversary can use to construct a formal object outside of this criterion?
</p>

<p>
Food for thought, dear reader; the next move is yours. Can you think of a more general criterion for existence? How would you construct a concept that cannot be formed from at least one formula in at least one descriptive language?
</p>
</article>
<footer id="postamble" class="status">

  <a href="https://twitter.com/_ptsw">Twitter</a>
  <a href="https://github.com/paultsw">GitHub</a>
  <a href="https://stackoverflow.com/users/3141064/ptsw">StackOverflow</a>
</footer>
</body>
</html>
